our_optimization/eval_results_c2/6.1.4-cs614-hacker/fio_perf.txt
allocstall: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
...
fio-3.36
Starting 4 processes
allocstall: Laying out IO file (1 file / 2048MiB)
allocstall: Laying out IO file (1 file / 2048MiB)
allocstall: Laying out IO file (1 file / 2048MiB)
[...]

allocstall: (groupid=0, jobs=4): err= 0: pid=3703: Wed Apr 22 23:33:37 2026
  write: IOPS=561, BW=561MiB/s (589MB/s)(8192MiB/14595msec); 0 zone resets
    clat (usec): min=354, max=86985, avg=7042.27, stdev=9939.56
     lat (usec): min=364, max=86995, avg=7066.14, stdev=9935.31
    clat percentiles (usec):
     |  1.00th=[  375],  5.00th=[  400], 10.00th=[  424], 20.00th=[  453],
     | 30.00th=[  482], 40.00th=[  510], 50.00th=[  562], 60.00th=[  758],
     | 70.00th=[10814], 80.00th=[19792], 90.00th=[23462], 95.00th=[25035],
     | 99.00th=[30278], 99.50th=[32113], 99.90th=[52167], 99.95th=[58983],
     | 99.99th=[86508]
   bw (  KiB/s): min=438043, max=1413120, per=99.67%, avg=572868.54, stdev=55812.81, samples=114
   iops        : min=  427, max= 1380, avg=558.41, stdev=54.59, samples=114
  lat (usec)   : 500=37.01%, 750=22.84%, 1000=4.19%
  lat (msec)   : 2=2.25%, 4=0.73%, 10=2.38%, 20=10.95%, 50=19.54%
  lat (msec)   : 100=0.11%
  cpu          : usr=0.44%, sys=7.66%, ctx=7412, majf=0, minf=42
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=561MiB/s (589MB/s), 561MiB/s-561MiB/s (589MB/s-589MB/s), io=8192MiB (8590MB), run=14595-14595msec

Disk stats (read/write):
  loop18: ios=0/8293, sectors=0/15760672, merge=0/0, ticks=0/378707, in_queue=379659, util=94.58%