our_optimization/eval_results_c2/6.1.4-cs614-hacker/fio_repeat1.txt
thrput1: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.36
Starting 4 processes
thrput1: Laying out IO file (1 file / 2048MiB)
thrput1: Laying out IO file (1 file / 2048MiB)
thrput1: Laying out IO file (1 file / 2048MiB)
[...]

thrput1: (groupid=0, jobs=4): err= 0: pid=3859: Wed Apr 22 23:37:40 2026
  write: IOPS=773, BW=774MiB/s (812MB/s)(8192MiB/10585msec); 0 zone resets
    clat (usec): min=342, max=75915, avg=4979.04, stdev=9969.29
     lat (usec): min=353, max=75930, avg=5002.35, stdev=9967.32
    clat percentiles (usec):
     |  1.00th=[  375],  5.00th=[  396], 10.00th=[  412], 20.00th=[  441],
     | 30.00th=[  465], 40.00th=[  494], 50.00th=[  529], 60.00th=[  578],
     | 70.00th=[  701], 80.00th=[ 1565], 90.00th=[21627], 95.00th=[28443],
     | 99.00th=[38011], 99.50th=[41681], 99.90th=[58983], 99.95th=[60556],
     | 99.99th=[76022]
   bw (  KiB/s): min=471040, max=2083833, per=100.00%, avg=810169.24, stdev=88471.37, samples=80
   iops        : min=  460, max= 2034, avg=791.01, stdev=86.35, samples=80
  lat (usec)   : 500=42.44%, 750=29.76%, 1000=4.71%
  lat (msec)   : 2=3.93%, 4=0.88%, 10=0.39%, 20=5.80%, 50=11.84%
  lat (msec)   : 100=0.24%
  cpu          : usr=0.50%, sys=10.92%, ctx=7214, majf=0, minf=57
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=774MiB/s (812MB/s), 774MiB/s-774MiB/s (812MB/s-812MB/s), io=8192MiB (8590MB), run=10585-10585msec

Disk stats (read/write):
  loop18: ios=0/8250, sectors=0/15715688, merge=0/0, ticks=0/267859, in_queue=268354, util=96.93%