our_optimization/eval_results_c2/6.1.4-cs614-hacker/fio_repeat2.txt
thrput2: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.36
Starting 4 processes
thrput2: Laying out IO file (1 file / 2048MiB)
thrput2: Laying out IO file (1 file / 2048MiB)
thrput2: Laying out IO file (1 file / 2048MiB)
[...]

thrput2: (groupid=0, jobs=4): err= 0: pid=3914: Wed Apr 22 23:38:12 2026
  write: IOPS=654, BW=655MiB/s (686MB/s)(8192MiB/12513msec); 0 zone resets
    clat (usec): min=346, max=116008, avg=5907.53, stdev=13412.33
     lat (usec): min=357, max=116021, avg=5928.84, stdev=13410.20
    clat percentiles (usec):
     |  1.00th=[   371],  5.00th=[   388], 10.00th=[   400], 20.00th=[   424],
     | 30.00th=[   445], 40.00th=[   465], 50.00th=[   498], 60.00th=[   537],
     | 70.00th=[   635], 80.00th=[   938], 90.00th=[ 28181], 95.00th=[ 37487],
     | 99.00th=[ 56886], 99.50th=[ 63177], 99.90th=[ 93848], 99.95th=[103285],
     | 99.99th=[115868]
   bw (  KiB/s): min=411419, max=2103296, per=100.00%, avg=690628.97, stdev=84466.24, samples=95
   iops        : min=  401, max= 2054, avg=673.84, stdev=82.54, samples=95
  lat (usec)   : 500=51.01%, 750=24.66%, 1000=5.15%
  lat (msec)   : 2=2.76%, 4=0.54%, 10=0.16%, 20=0.60%, 50=13.48%
  lat (msec)   : 100=1.57%, 250=0.07%
  cpu          : usr=0.34%, sys=8.89%, ctx=5872, majf=0, minf=51
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=655MiB/s (686MB/s), 655MiB/s-655MiB/s (686MB/s-686MB/s), io=8192MiB (8590MB), run=12513-12513msec

Disk stats (read/write):
  loop18: ios=4/8380, sectors=32/15921216, merge=0/0, ticks=234/316827, in_queue=317943, util=97.18%