our_optimization/eval_results_c2/6.1.4-cs614-hacker/fio_repeat3.txt
thrput3: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.36
Starting 4 processes
thrput3: Laying out IO file (1 file / 2048MiB)
thrput3: Laying out IO file (1 file / 2048MiB)
thrput3: Laying out IO file (1 file / 2048MiB)
[...]

thrput3: (groupid=0, jobs=4): err= 0: pid=3977: Wed Apr 22 23:39:47 2026
  write: IOPS=202, BW=203MiB/s (212MB/s)(8192MiB/40439msec); 0 zone resets
    clat (usec): min=334, max=1039.2k, avg=19327.66, stdev=47402.39
     lat (usec): min=344, max=1039.2k, avg=19348.25, stdev=47401.29
    clat percentiles (usec):
     |  1.00th=[    363],  5.00th=[    392], 10.00th=[    408],
     | 20.00th=[    433], 30.00th=[    457], 40.00th=[    498],
     | 50.00th=[    603], 60.00th=[  10421], 70.00th=[  13698],
     | 80.00th=[  23725], 90.00th=[  50594], 95.00th=[  86508],
     | 99.00th=[ 229639], 99.50th=[ 333448], 99.90th=[ 455082],
     | 99.95th=[ 501220], 99.99th=[1035994]
   bw (  KiB/s): min=10160, max=1847296, per=100.00%, avg=210137.98, stdev=69694.12, samples=313
   iops        : min=    6, max= 1804, avg=203.82, stdev=68.12, samples=313
  lat (usec)   : 500=40.92%, 750=12.22%, 1000=1.89%
  lat (msec)   : 2=1.56%, 4=0.50%, 10=2.31%, 20=18.09%, 50=12.37%
  lat (msec)   : 100=5.98%, 250=3.32%, 500=0.78%, 750=0.05%, 2000=0.01%
  cpu          : usr=0.13%, sys=2.61%, ctx=14651, majf=0, minf=56
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=203MiB/s (212MB/s), 203MiB/s-203MiB/s (212MB/s-212MB/s), io=8192MiB (8590MB), run=40439-40439msec

Disk stats (read/write):
  loop18: ios=0/11845, sectors=0/16384400, merge=0/0, ticks=0/1425796, in_queue=1441924, util=98.49%