our_optimization/eval_results_c2/6.1.4-cs614-hacker/fio_repeat4.txt
thrput4: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.36
Starting 4 processes
thrput4: Laying out IO file (1 file / 2048MiB)
thrput4: Laying out IO file (1 file / 2048MiB)
thrput4: Laying out IO file (1 file / 2048MiB)
[...]

thrput4: (groupid=0, jobs=4): err= 0: pid=4044: Wed Apr 22 23:41:54 2026
  write: IOPS=203, BW=203MiB/s (213MB/s)(8192MiB/40259msec); 0 zone resets
    clat (usec): min=331, max=430666, avg=19157.27, stdev=32866.68
     lat (usec): min=342, max=430690, avg=19178.15, stdev=32865.71
    clat percentiles (usec):
     |  1.00th=[   359],  5.00th=[   383], 10.00th=[   400], 20.00th=[   437],
     | 30.00th=[   465], 40.00th=[   502], 50.00th=[   619], 60.00th=[ 14222],
     | 70.00th=[ 22414], 80.00th=[ 35390], 90.00th=[ 55313], 95.00th=[ 79168],
     | 99.00th=[137364], 99.50th=[185598], 99.90th=[371196], 99.95th=[413139],
     | 99.99th=[429917]
   bw (  KiB/s): min=34750, max=1871935, per=100.00%, avg=213554.02, stdev=68947.65, samples=312
   iops        : min=   32, max= 1825, avg=207.11, stdev=67.34, samples=312
  lat (usec)   : 500=39.75%, 750=12.72%, 1000=1.45%
  lat (msec)   : 2=1.49%, 4=0.40%, 10=0.43%, 20=10.53%, 50=21.63%
  lat (msec)   : 100=9.57%, 250=1.79%, 500=0.23%
  cpu          : usr=0.16%, sys=2.61%, ctx=8915, majf=0, minf=50
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=203MiB/s (213MB/s), 203MiB/s-203MiB/s (213MB/s-213MB/s), io=8192MiB (8590MB), run=40259-40259msec

Disk stats (read/write):
  loop18: ios=4/8243, sectors=32/15795408, merge=0/0, ticks=172/1278817, in_queue=1291666, util=99.37%