our_optimization/eval_results_c2/6.1.4-cs614-hacker/fio_repeat5.txt
thrput5: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.36
Starting 4 processes
thrput5: Laying out IO file (1 file / 2048MiB)
thrput5: Laying out IO file (1 file / 2048MiB)
thrput5: Laying out IO file (1 file / 2048MiB)
[...]

thrput5: (groupid=0, jobs=4): err= 0: pid=4105: Wed Apr 22 23:44:07 2026
  write: IOPS=189, BW=190MiB/s (199MB/s)(8192MiB/43122msec); 0 zone resets
    clat (usec): min=312, max=563223, avg=20866.12, stdev=44618.20
     lat (usec): min=318, max=563232, avg=20885.57, stdev=44617.90
    clat percentiles (usec):
     |  1.00th=[   351],  5.00th=[   367], 10.00th=[   383], 20.00th=[   420],
     | 30.00th=[   469], 40.00th=[   685], 50.00th=[ 10028], 60.00th=[ 12780],
     | 70.00th=[ 15795], 80.00th=[ 23725], 90.00th=[ 52691], 95.00th=[ 87557],
     | 99.00th=[208667], 99.50th=[350225], 99.90th=[434111], 99.95th=[455082],
     | 99.99th=[566232]
   bw (  KiB/s): min=12283, max=1648640, per=100.00%, avg=194821.91, stdev=61179.20, samples=338
   iops        : min=   11, max= 1610, avg=188.86, stdev=59.79, samples=338
  lat (usec)   : 500=33.59%, 750=7.03%, 1000=1.05%
  lat (msec)   : 2=1.18%, 4=0.24%, 10=6.88%, 20=27.14%, 50=12.13%
  lat (msec)   : 100=6.93%, 250=3.10%, 500=0.67%, 750=0.04%
  cpu          : usr=0.14%, sys=2.31%, ctx=12410, majf=0, minf=42
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=190MiB/s (199MB/s), 190MiB/s-190MiB/s (199MB/s-199MB/s), io=8192MiB (8590MB), run=43122-43122msec

Disk stats (read/write):
  loop18: ios=0/8136, sectors=0/15751280, merge=0/0, ticks=0/1618476, in_queue=1638931, util=94.89%